; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v10 ?v3)
             (pred_9 ?v11 ?v12)
             (pred_6 ?v10 ?v12)
             (pred_10 ?v9 ?v10 )
	     (pred_12 ?v10)
             (pred_2 ?v5)
             (pred_8 ?v11)
             (pred_1 ?v12)
             (pred_3 ?v10)
             (pred_5 ?v11)
             (pred_4 ?v10)
             (pred_11 ))



(:action op_4
:parameters (?v6 ?v1 ?v13 ?v8)
:precondition (and (pred_2 ?v6) (pred_2 ?v1) (pred_8 ?v13) (pred_1 ?v8)
          (pred_7 ?v6 ?v1) (pred_9 ?v13 ?v8)
                   (pred_6 ?v1 ?v8) (pred_12 ?v6) 
                   (pred_3 ?v1) (pred_5 ?v13))
:effect (and  (pred_4 ?v1) (not (pred_3 ?v1))))


(:action op_3
:parameters (?v6 ?v7)
:precondition (and (pred_2 ?v6) (pred_2 ?v7)
               (pred_12 ?v6) (pred_7 ?v6 ?v7) (pred_4 ?v7))
:effect (and (pred_12 ?v7) (not (pred_12 ?v6))))

(:action op_2
:parameters (?v6 ?v13)
:precondition (and (pred_2 ?v6) (pred_8 ?v13) 
                  (pred_12 ?v6) (pred_10 ?v13 ?v6) (pred_11 ))
:effect (and (pred_5 ?v13)
   (not (pred_10 ?v13 ?v6)) (not (pred_11 ))))


(:action op_5
:parameters (?v6 ?v2 ?v4)
:precondition (and (pred_2 ?v6) (pred_8 ?v2) (pred_8 ?v4)
                  (pred_12 ?v6) (pred_5 ?v4) (pred_10 ?v2 ?v6))
:effect (and (pred_5 ?v2) (pred_10 ?v4 ?v6)
        (not (pred_5 ?v4)) (not (pred_10 ?v2 ?v6))))

(:action op_1
:parameters (?v6 ?v13)
:precondition (and (pred_2 ?v6) (pred_8 ?v13) 
                  (pred_12 ?v6) (pred_5 ?v13))
:effect (and (pred_11 ) (pred_10 ?v13 ?v6) (not (pred_5 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_19 obj_07 obj_02 obj_17 obj_04 obj_01 obj_24 obj_14 obj_06 obj_32 obj_13 obj_15 obj_11 obj_05 obj_25 obj_21 obj_18 obj_12 obj_29 obj_30 obj_31 obj_03 obj_23 obj_22 obj_28
    obj_26 obj_27 obj_20
    obj_09 obj_08 obj_16 obj_10
    )

    (:init
       (pred_11)

       (pred_2 obj_19)
       (pred_2 obj_07)
       (pred_2 obj_02)
       (pred_2 obj_17)
       (pred_2 obj_04)
       (pred_2 obj_01)
       (pred_2 obj_24)
       (pred_2 obj_14)
       (pred_2 obj_06)
       (pred_2 obj_32)
       (pred_2 obj_13)
       (pred_2 obj_15)
       (pred_2 obj_11)
       (pred_2 obj_05)
       (pred_2 obj_25)
       (pred_2 obj_21)
       (pred_2 obj_18)
       (pred_2 obj_12)
       (pred_2 obj_29)
       (pred_2 obj_30)
       (pred_2 obj_31)
       (pred_2 obj_03)
       (pred_2 obj_23)
       (pred_2 obj_22)
       (pred_2 obj_28)
       (pred_1 obj_26)
       (pred_1 obj_27)
       (pred_1 obj_20)
       (pred_8 obj_09)
       (pred_8 obj_08)
       (pred_8 obj_16)
       (pred_8 obj_10)

       (pred_7 obj_19 obj_01)
       (pred_7 obj_19 obj_07)
       (pred_7 obj_07 obj_24)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_07 obj_19)
       (pred_7 obj_02 obj_14)
       (pred_7 obj_02 obj_17)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_17 obj_06)
       (pred_7 obj_17 obj_04)
       (pred_7 obj_17 obj_02)
       (pred_7 obj_04 obj_32)
       (pred_7 obj_04 obj_17)
       (pred_7 obj_01 obj_13)
       (pred_7 obj_01 obj_24)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_24 obj_15)
       (pred_7 obj_24 obj_14)
       (pred_7 obj_24 obj_07)
       (pred_7 obj_24 obj_01)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_14 obj_02)
       (pred_7 obj_14 obj_24)
       (pred_7 obj_06 obj_05)
       (pred_7 obj_06 obj_32)
       (pred_7 obj_06 obj_17)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_32 obj_25)
       (pred_7 obj_32 obj_04)
       (pred_7 obj_32 obj_06)
       (pred_7 obj_13 obj_21)
       (pred_7 obj_13 obj_15)
       (pred_7 obj_13 obj_01)
       (pred_7 obj_15 obj_18)
       (pred_7 obj_15 obj_11)
       (pred_7 obj_15 obj_24)
       (pred_7 obj_15 obj_13)
       (pred_7 obj_11 obj_12)
       (pred_7 obj_11 obj_05)
       (pred_7 obj_11 obj_14)
       (pred_7 obj_11 obj_15)
       (pred_7 obj_05 obj_29)
       (pred_7 obj_05 obj_25)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_05 obj_11)
       (pred_7 obj_25 obj_30)
       (pred_7 obj_25 obj_32)
       (pred_7 obj_25 obj_05)
       (pred_7 obj_21 obj_31)
       (pred_7 obj_21 obj_18)
       (pred_7 obj_21 obj_13)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_18 obj_12)
       (pred_7 obj_18 obj_15)
       (pred_7 obj_18 obj_21)
       (pred_7 obj_12 obj_23)
       (pred_7 obj_12 obj_29)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_12 obj_18)
       (pred_7 obj_29 obj_22)
       (pred_7 obj_29 obj_30)
       (pred_7 obj_29 obj_05)
       (pred_7 obj_29 obj_12)
       (pred_7 obj_30 obj_28)
       (pred_7 obj_30 obj_25)
       (pred_7 obj_30 obj_29)
       (pred_7 obj_31 obj_03)
       (pred_7 obj_31 obj_21)
       (pred_7 obj_03 obj_23)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_03 obj_31)
       (pred_7 obj_23 obj_22)
       (pred_7 obj_23 obj_12)
       (pred_7 obj_23 obj_03)
       (pred_7 obj_22 obj_28)
       (pred_7 obj_22 obj_29)
       (pred_7 obj_22 obj_23)
       (pred_7 obj_28 obj_30)
       (pred_7 obj_28 obj_22)
       (pred_3 obj_18)
       (pred_3 obj_04)
       (pred_3 obj_30)
       (pred_3 obj_32)
       (pred_6  obj_18 obj_26)
       (pred_6  obj_04 obj_27)
       (pred_6  obj_30 obj_20)
       (pred_6  obj_32 obj_26)
       (pred_4 obj_19)
       (pred_4 obj_07)
       (pred_4 obj_02)
       (pred_4 obj_17)
       (pred_4 obj_01)
       (pred_4 obj_24)
       (pred_4 obj_14)
       (pred_4 obj_06)
       (pred_4 obj_13)
       (pred_4 obj_15)
       (pred_4 obj_11)
       (pred_4 obj_05)
       (pred_4 obj_25)
       (pred_4 obj_21)
       (pred_4 obj_12)
       (pred_4 obj_29)
       (pred_4 obj_31)
       (pred_4 obj_03)
       (pred_4 obj_23)
       (pred_4 obj_22)
       (pred_4 obj_28)

       (pred_9  obj_09 obj_26)
       (pred_9  obj_08 obj_27)
       (pred_9  obj_16 obj_20)
       (pred_9  obj_10 obj_26)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_08 obj_24)
       (pred_10 obj_16 obj_29)
       (pred_10 obj_10 obj_31)
       (pred_12 obj_02)
    )

    (:goal (and
       (pred_10 obj_09 obj_22)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_16 obj_25)
       (pred_10 obj_10 obj_05)
    ))
(:constraints
  (always (not (pred_12 obj_14)))
)
)

; plan
1. (op_3 obj_02 obj_17)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_17)
   goals met: 0 of 4
2. (op_3 obj_17 obj_06)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_06)
   goals met: 0 of 4
3. (op_3 obj_06 obj_05)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_05)
   goals met: 0 of 4
4. (op_3 obj_05 obj_29)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_29)
   goals met: 0 of 4
5. (op_2 obj_29 obj_16)
   deleted: (pred_10 obj_16 obj_29) (pred_11)
   added: (pred_5 obj_16)
   goals met: 0 of 4
6. (op_3 obj_29 obj_22)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_22)
   goals met: 0 of 4
7. (op_1 obj_22 obj_16)
   deleted: (pred_5 obj_16)
   added: (pred_11) (pred_10 obj_16 obj_22)
   goals met: 0 of 4
8. (op_3 obj_22 obj_23)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_23)
   goals met: 0 of 4
9. (op_3 obj_23 obj_03)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_03)
   goals met: 0 of 4
10. (op_3 obj_03 obj_31)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_31)
   goals met: 0 of 4
11. (op_2 obj_31 obj_10)
   deleted: (pred_10 obj_10 obj_31) (pred_11)
   added: (pred_5 obj_10)
   goals met: 0 of 4
12. (op_3 obj_31 obj_03)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_03)
   goals met: 0 of 4
13. (op_3 obj_03 obj_23)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_23)
   goals met: 0 of 4
14. (op_3 obj_23 obj_22)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_22)
   goals met: 0 of 4
15. (op_3 obj_22 obj_29)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_29)
   goals met: 0 of 4
16. (op_3 obj_29 obj_05)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_05)
   goals met: 0 of 4
17. (op_1 obj_05 obj_10)
   deleted: (pred_5 obj_10)
   added: (pred_11) (pred_10 obj_10 obj_05)
   goals met: 1 of 4
18. (op_3 obj_05 obj_29)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_29)
   goals met: 1 of 4
19. (op_3 obj_29 obj_22)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_22)
   goals met: 1 of 4
20. (op_2 obj_22 obj_16)
   deleted: (pred_10 obj_16 obj_22) (pred_11)
   added: (pred_5 obj_16)
   goals met: 1 of 4
21. (op_3 obj_22 obj_29)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_29)
   goals met: 1 of 4
22. (op_3 obj_29 obj_05)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_05)
   goals met: 1 of 4
23. (op_3 obj_05 obj_25)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_25)
   goals met: 1 of 4
24. (op_1 obj_25 obj_16)
   deleted: (pred_5 obj_16)
   added: (pred_11) (pred_10 obj_16 obj_25)
   goals met: 2 of 4
25. (op_3 obj_25 obj_05)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_05)
   goals met: 2 of 4
26. (op_3 obj_05 obj_11)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_11)
   goals met: 2 of 4
27. (op_2 obj_11 obj_09)
   deleted: (pred_10 obj_09 obj_11) (pred_11)
   added: (pred_5 obj_09)
   goals met: 2 of 4
28. (op_3 obj_11 obj_05)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_05)
   goals met: 2 of 4
29. (op_3 obj_05 obj_29)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_29)
   goals met: 2 of 4
30. (op_3 obj_29 obj_22)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_22)
   goals met: 2 of 4
31. (op_1 obj_22 obj_09)
   deleted: (pred_5 obj_09)
   added: (pred_11) (pred_10 obj_09 obj_22)
   goals met: 3 of 4
32. (op_3 obj_22 obj_29)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_29)
   goals met: 3 of 4
33. (op_3 obj_29 obj_05)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_05)
   goals met: 3 of 4
34. (op_3 obj_05 obj_06)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_06)
   goals met: 3 of 4
35. (op_3 obj_06 obj_17)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_17)
   goals met: 3 of 4
36. (op_3 obj_17 obj_02)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_02)
   goals met: 3 of 4
37. (op_3 obj_02 obj_07)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_07)
   goals met: 3 of 4
38. (op_3 obj_07 obj_24)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_24)
   goals met: 3 of 4
39. (op_2 obj_24 obj_08)
   deleted: (pred_10 obj_08 obj_24) (pred_11)
   added: (pred_5 obj_08)
   goals met: 3 of 4
40. (op_3 obj_24 obj_07)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_07)
   goals met: 3 of 4
41. (op_3 obj_07 obj_02)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_02)
   goals met: 3 of 4
42. (op_3 obj_02 obj_17)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_17)
   goals met: 3 of 4
43. (op_4 obj_17 obj_04 obj_08 obj_27)
   deleted: (pred_3 obj_04)
   added: (pred_4 obj_04)
   goals met: 3 of 4
44. (op_3 obj_17 obj_04)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_04)
   goals met: 3 of 4
45. (op_1 obj_04 obj_08)
   deleted: (pred_5 obj_08)
   added: (pred_11) (pred_10 obj_08 obj_04)
   goals met: 4 of 4
